------------------------------------------------------------------------------------
-- game/resources/common_res.lua
--
--
--
-- @module      公共资源
-- @author      admin
-- @license     MIT
-- @release     v1.0.0 - 2023-03-22
-- @copyright   2023
-- @usage
-- local common_res = import('game/resources/common_res')
------------------------------------------------------------------------------------

local common_res = {
    -- 游戏打怪范围
    KILL_RANGE = {
        [0] = 20,
        [1] = 30,
        [2] = 40,
        [3] = 100,
    },
}

-- 自身模块
local this = common_res

-------------------------------------------------------------------------------------
-- 返回实例对象
-- 
-- @export
return common_res

-------------------------------------------------------------------------------------