------------------------------------------------------------------------------------
-- game/resources/creature_res.lua
--
--
--
-- @module      creature_res
-- @author      admin
-- @license     MIT
-- @release     v1.0.0 - 2023-03-22
-- @copyright   2023
-- @usage
-- local creature_res = import('game/resources/creature_res')
------------------------------------------------------------------------------------

-- (0 坐骑，1翅膀，2武器图)资源
local creature_res = {
    -- 职业对应前置名称,模糊配对武器图职业
    WEAPON_COND_JOB_SEL_ID = {
        [1] = 1,-- 大剑
        [2] = 2,-- 法杖
        [3] = 3,-- 剑盾
        [4] = 4,-- 双剑
        [5] = 5,-- 猎人
        [6] = 6,-- 匕首
        [7] = 7,-- 魔杖
        [8] = 8,-- 魔法棒
    },
}

-- 自身模块
local this = creature_res

-------------------------------------------------------------------------------------
-- [条件] 配对当前职业武器图
-------------------------------------------------------------------------------------
creature_res.is_weapon_jop_by_id = function(weapon_class_id)
    local job = 5 -- 后续直接调用获取职业ID 的命令替换
    return weapon_class_id == -1 or this.WEAPON_COND_JOB_SEL_ID[job] == weapon_class_id or false
end

-------------------------------------------------------------------------------------
-- 返回实例对象
-- 
-- @export
return creature_res

-------------------------------------------------------------------------------------