------------------------------------------------------------------------------------
-- game/resources/fight_mon_res.lua
--
--
--
-- @module      fight_mon_res
-- @author      admin
-- @license     MIT
-- @release     v1.0.0 - 2023-03-22
-- @copyright   2023
-- @usage
-- local fight_mon_res = import('game/resources/fight_mon_res')
------------------------------------------------------------------------------------
local fight_mon_res = {
    -- 生成redis中记录坐标
    CREATE_POS_LIST = {
        ['野外挂机'] = {
            --序号=地图ID,坐标X,坐标Y,坐标Z,最低等级,最高等级,打怪范围R,文明模式M,线路L,打怪模式:0内置 1非内置
            'MID:205,X:35939,Y:-48904,Z:2138,NLV:1,MLV:100,R:20,M:3,L:1,MOD:0,PK模式:0',
        },
        ['繁荣的土1层'] = {
            'MID：10010101,X：-43479,Y：-44875,Z：3677,NLV：1,MLV：100,R：20,M：3,L：1,MOD：0,PK模式：0'
        },
        ['繁荣的土2层'] = {
            'MID：10010201,X：22845,Y：12270,Z：1724,NLV：1,MLV：100,R：20,M：3,L：1,MOD：0,PK模式：0'
        },
        ['修炼之林1层'] = {
            'MID：10020101,X：45082,Y：-47942,Z：-108,NLV：1,MLV：100,R：20,M：3,L：1,MOD：0,PK模式：0'
        },
        ['修炼之林2层'] = {
            'MID：10020201,X：8713,Y：-37241,Z：80,NLV：1,MLV：100,R：20,M：3,L：1,MOD：0,PK模式：0'
        },
        ['伊莱殿神殿1层'] = {
            'MID：2002101,X：14553,Y：-6708,Z：190,NLV：1,MLV：100,R：20,M：3,L：1,MOD：0,PK模式：0'
        },
        ['伊莱殿神殿2层'] = {
            'MID：2002201,X：-12864,Y：-4889,Z：30,NLV：1,MLV：100,R：20,M：3,L：1,MOD：0,PK模式：0'
        },
        ['圣科拿遗迹1层'] = {
        
        },
        ['马萨塔冰窟1层'] = {
            'MID：50000101,X：10003,Y：-3120,Z：190,NLV：1,MLV：100,R：20,M：3,L：1,MOD：0,PK模式：0'
        },
        ['马萨塔冰窟2层'] = {
            'MID：50000201,X：-4827,Y：5014,Z：190,NLV：1,MLV：100,R：20,M：3,L：1,MOD：0,PK模式：0'
        },
    }
}

-- 自身模块
local this = fight_mon_res

-------------------------------------------------------------------------------------
-- 返回实例对象
-- 
-- @export
return fight_mon_res

-------------------------------------------------------------------------------------