-------------------------------------------------------------------------------------
-- -*- coding: utf-8 -*-
--
-- @author:   admin
-- @email:    88888@qq.com
-- @date:     2022-06-30
-- @module:   login_res
-- @describe: 登陆模块用到的资源
-- @version:  v1.0
--
local game_unit = game_unit
-------------------------------------------------------------------------------------
-- 登陆模块资源
local login_res = {
    -- 创建角色后下线[0关闭  1开启]
    END_GAME_OFTER_CREATE           = 0,
    -- 可创建角色职业
    CAN_CREATE_JOB                  = {
        ['战士'] = false,
        ['剑客'] = false,
        ['猎人'] = true,
        ['法师'] = false
    },
    -- 启动页面
    STATUS_INTRO_PAGE               = 0x00,      -- 进入游戏时的启动页面
    STATUS_LOGO_PAGE                = 0x02,      -- 游戏logo页面
    STATUS_DOWNLOAD_PAGE            = 0x04,      -- 游戏下载更新页面
    STATUS_RESERVED1                = 0x08,      -- 预留状态1
    STATUS_RESERVED2                = 0x10,      -- 预留状态2
  
    -- 登陆页面
    STATUS_LOGIN_PAGE               = 0x20,      -- 登陆页面
    STATUS_ACCOUNT_LOGIN_PAGE       = 0x40,      -- 帐号密码登陆页面
    STATUS_THIRDPARTY_LOGIN_PAGE    = 0x40,      -- 第三方登陆页面(暂定成一个)
    STATUS_GOOGLE_LOGIN_PAGE        = 0x80,      -- Google账号登陆页面
    STATUS_APPLE_LOGIN_PAGE         = 0x100,     -- Apple账号登陆页面
    STATUS_FACEBOOK_LOGIN_PAGE      = 0x200,     -- Facebook账号登陆页面
    STATUS_TERMS_AGREEMENT_PAGE     = 0x400,     -- 服务条款同意页面
    STATUS_SERVER_SELECT_PAGE       = 0x800,     -- 服务器选择页面
    STATUS_RESERVED3                = 0x1000,    -- 预留状态3
    STATUS_RESERVED4                = 0x2000,    -- 预留状态4
  
    -- 选择角色
    STATUS_CHARACTER_SELECT         = 0x4000,    -- 角色选择页面
    STATUS_RESERVED5                = 0x8000,    -- 预留状态5
    STATUS_RESERVED6                = 0x10000,   -- 预留状态6
  
    -- 创建角色
    STATUS_CREATE_CHARACTER         = 0x20000,   -- 创建角色页面
    STATUS_RESERVED7                = 0x40000,   -- 预留状态7
    STATUS_RESERVED8                = 0x80000,   -- 预留状态8
  
    -- 游戏里面
    STATUS_IN_GAME                  = 0x100000,  -- 进入游戏内部状态
    STATUS_LOADING_MAP              = 0x200000,  -- 地图加载中状态
    STATUS_RESERVED9                = 0x400000,  -- 预留状态9
    STATUS_RESERVED10               = 0x800000,  -- 预留状态10
    
    -- 服务器转换资源
    SERVER_TABLE = {
        -- 一区
        ['路德维希_骑士'] = '루트비히_나이트',
        ['路德维希_教皇'] = '루트비히_비숍',
        ['路德维希_宝塔'] = '루트비히_룩',
        -- 二区
        ['克莱门斯_教皇'] = '클레멘스_비숍',
        ['克莱门斯_宝塔'] = '클레멘스_룩',
        ['克莱门斯_骑士'] = '클레멘스_나이트',
        -- 三区
        ['加斯帕洛_骑士'] = '가스파르_나이트',
        ['加斯帕洛_教皇'] = '가스파르_비숍',
        ['加斯帕洛_宝塔'] = '가스파르_룩',
        -- 四区
        ['布兰特_宝塔']   = '브란트_룩',
        ['布兰特_教皇']   = '브란트_비숍',
        ['布兰特_骑士']   = '브란트_나이트',
        -- 五区
        ['埃莉诺语_教皇'] = '엘레노어_비숍',
        ['埃莉诺语_骑士'] = '엘레노어_나이트',
        ['埃莉诺语_宝塔'] = '엘레노어_룩',
        -- 六区
        ['维亚托尔_骑士'] = '비아토르_나이트',
        ['维亚托尔_宝塔'] = '비아토르_룩',
        ['维亚托尔_教皇'] = '비아토르_비숍',
        -- 七区
        ['泰奥菲尔_教皇'] = '테오필_비숍',
        ['泰奥菲尔_骑士'] = '테오필_나이트',
        ['泰奥菲尔_宝塔'] = '테오필_룩',
        -- 八区
        ['阿琳_骑士']    = '알린_나이트',
        ['阿琳_教皇']    = '알린_비숍',
        ['阿琳_宝塔']    = '알린_룩',
        -- 九区
        ['约翰内斯_骑士'] = '요하네스_나이트',
        ['约翰内斯_教皇'] = '요하네스_비숍',
        ['约翰内斯_宝塔'] = '요하네스_룩',
        -- 十区
        ['皮亚蒙特_宝塔'] = '피아몬트_룩',
        ['皮亚蒙特_教皇'] = '피아몬트_비숍',
        ['皮亚蒙特_骑士'] = '피아몬트_나이트',
        -- 十一区
        ['因诺陈西_骑士'] = '인노첸시오_나이트',
        ['因诺陈西_宝塔'] = '인노첸시오_룩',
        ['因诺陈西_教皇'] = '인노첸시오_비숍',
        -- 十二区
        ['汉菲尔_教皇']   = '험펠_비숍',
        ['汉菲尔_宝塔']   = '험펠_룩',
        ['汉菲尔_骑士']   = '험펠_나이트',
        -- 十三区
        ['理查德_骑士']   = '리처드_나이트',
        ['理查德_宝塔']   = '리처드_룩',
        ['理查德_教皇']   = '리처드_비숍',
        -- 十四区
        ['加尼吧_骑士']   = '가니시오_나이트',
        ['加尼吧_宝塔']   = '가니시오_룩',
        ['加尼吧_教皇']   = '가니시오_비숍',
        -- 十五区
        ['弗里德里希_宝塔'] = '프리드리히_룩',
        ['弗里德里希_教皇'] = '프리드리히_비숍',
        ['弗里德里希_骑士'] = '프리드리히_나이트',
    }
}

local this = login_res

-------------------------------------------------------------------------------------
-- 是否为可创建的职业
login_res.can_create_job = function(job_name)
    return this.CAN_CREATE_JOB[job_name]
end

-------------------------------------------------------------------------------------
-- 转换服务器名称
login_res.translate_server = function(server_name)
    return this.SERVER_TABLE[server_name]
end

-------------------------------------------------------------------------------------
-- 是否在过图中
login_res.is_loading_map = function()
    return game_unit.get_game_status_ex() == this.STATUS_LOADING_MAP
end

-------------------------------------------------------------------------------------
-- 返回对象
return login_res

-------------------------------------------------------------------------------------