------------------------------------------------------------------------------------
-- game/resources/quick_res.lua
--
--
--
-- @module      quick_res
-- @author      admin
-- @license     MIT
-- @release     v1.0.0 - 2023-03-22
-- @copyright   2023
-- @usage
-- local quick_res = import('game/resources/quick_res')
------------------------------------------------------------------------------------
---@class quick_res
local quick_res = {
    CAN_SET_LIST = {
        -- { { 设置名称,设置类型 } }
        [0] = { {'集中攻击',1} },
        [1] = { {'情态',1} },
        [2] = { {'速决',1} },
        [3] = { {'精准射击',1} },
        [4] = { {'狩猎开始',1} },
        --[5] = { {'필승의 영약(귀속)',2} },--白色必胜的灵药
        --[6] = { {'돌격의 영약(귀속)',2} },--蓝色攻速灵药
        -- [7] = { {'파수의 영약(귀속)',2} },--绿色防御灵药
    }
}

-- 自身模块
local this = quick_res

-------------------------------------------------------------------------------------
-- 返回实例对象
-- 
-- @export
return quick_res

-------------------------------------------------------------------------------------